import React from "react";
import { useState } from "react";
import "../style/PopupMenue.css";
import { Form } from "react-bootstrap";
import ReactDOM from "react-dom";
function PopupMenu({ onClose }) {
  const [confirme, setConfirme] = useState(false);

  return ReactDOM.createPortal(
    <div className="overlay-background">
      <div className="popup">
        <p dir="rtl">
          إقرار قبول بإستخدام البيانات: اقر بقبولي بإستخدام بياناتي وفقاً للشروط
          المذكورة بهذا الاقرار كما اقر بتصريحي الكامل للشركة "اورنج مصر
          للاتصالات" واي طرف من الغير تفوضه بإستخدام تلك البيانات وذلك وفقاً
          لاغراض الاستخدام المعينة بهذا الاقرار.
        </p>
        <ul dir="rtl">
          <li>
            المعلومات التي تتحصل عليها الشركة: هي كل المعلومات التي من شأنها
            تعريف الشركة و/أو الجهه المعينة من قبل الشركة بالتعرف علي بياناتي
            بشكل جيد وفقاً للغرض من الاستخدام، وتشمل تلك المعلومات: أ)بيانات
            التواصل (الاسم ، البريد الالكتروني، رقم التليفون المحمول) ،ب)
            المستوي التعليمي (غير خريج/خريج "الجامعة/الكلية") ،ج) الدورات
            التدريبة التي تم الحصول عليها ، د) السيرة الذاتية.
          </li>
          <li>
            {" "}
            الغرض من الاستخدام: يكمن الغرض من الاستخدام من قبل الشركة أو اي من
            الاطراف المعينين من قبلها في اي مجال من المجالات الاتية: 1) امكانية
            توفير دعاوي لحضور ندوات، اجتماعات ، مناسبات عمل ، 2) معارض التوظيف ،
            3) استطلاعات الاستقصاء.
          </li>
          <li>
            الاطراف الاخري/الجهات المعينة من قبل الشركة: هم اي طرف قد تقوم اورنج
            بمشاركة المعلومات التي تحصلت عليها بحدود اغراض الاستخدام المصرح بهم
            بموجب هذا الاقرار.
          </li>
          <li>
            {" "}
            نطاق الاقرار: يسري هذا الاقرار بداية من تاريخ تحريره ولا يجوز إلغاءه
            أو الرجوع فيه من جانبي إلا بالحصول علي الموافقة الكتابية الخاصة
            بشركة اورنج مصر للاتصالات.
          </li>
          <li>
            {" "}
            حدود المسئولية: بموجب هذا الاقرار وبحدود ما يتم اقراره قانوناً ، لن
            تكون اورنج مسئولة بكل الاحوال ولن تتحمل "اورنچ" مسئولية وقوع أية
            خسارة أو ضرر من أي نوع كان، بما في ذلك ــ على سبيل المثال لا الحصر
            ــ الخَسارة غير المباشرة أو اللاحقة، أو الإصابة الشخصية التي تحدث
            للمقر، باستثناء أية مسئولية يتعذر استبعادها وفقًا القانون.
          </li>
          <li>
            أي بند لا يمتثل لبنود هذا الاقرار لا يُطبق، ويُعتبر كأنه لم يكن.
          </li>
          <li>
            {" "}
            القانون الحاكم وتسوية النزاعات: تخضع المعلومات وطريقه مشاركتها
            وشروطها للقانون المصري وأي نزاعات يخضع للولاية القضائية للمحاكم
            المصرية.
          </li>
        </ul>
        <div className="approve">
          <Form.Check
            // onClick={onClose}
            type="checkbox"
            label="I agree to Terms & Conditions "
            onClick={() => setConfirme(true)}
          />
          <button className="applay" onClick={onClose} disabled={!confirme}>
            Apply
          </button>
        </div>
      </div>
    </div>,
    document.getElementById("popup")
  );
}

export default PopupMenu;
